<a href="https://colab.research.google.com/github/MarkHallett/-CoLab/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Mark Hallett Pandas cheat sheet

https://colab.research.google.com/drive/1mEThPaL7BEvmTCw2AyYX-O3v8xUJpbVO#scrollTo=4Bk9GiEVVArL

## 1 General

dtypes, head, tail, index, describe, columns, shape, T, info, count

In [0]:
import pandas as pd
import numpy as np

In [37]:
d = ({'A':1,'B':'b','C':2.2})
df = pd.DataFrame(d,[0])
df.dtypes

A      int64
B     object
C    float64
dtype: object

In [38]:
df.head(5)

   A  B    C
0  1  b  2.2

In [39]:
df.index

Int64Index([0], dtype='int64')

In [40]:
df.describe()

         A    C
count  1.0  1.0
mean   1.0  2.2
std    NaN  NaN
min    1.0  2.2
25%    1.0  2.2
50%    1.0  2.2
75%    1.0  2.2
max    1.0  2.2

In [41]:
df.T

     0
A    1
B    b
C  2.2

In [42]:
df

   A  B    C
0  1  b  2.2

In [43]:
df.shape

(1, 3)

In [44]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1 entries, 0 to 0
Data columns (total 3 columns):
A    1 non-null int64
B    1 non-null object
C    1 non-null float64
dtypes: float64(1), int64(1), object(1)
memory usage: 112.0+ bytes

In [15]:
df.count()

A    3
B    3
C    3
dtype: int64

In [18]:
df.T

     0    1    2
A    1    2    3
B   22   33   44
C  333  444  555

In [35]:
pd1['c'].max()

'2'

In [48]:
# number of rows
len(pd1)

2

## 2 Data Into df

### Dictionary of columns ( variables)

In [25]:

import pandas as pd
data1 = { 'a':['b','c'] ,  'B':['A','B'] , 'c':['1','2'] , 'd':['1','2']   }

pd1 = pd.DataFrame(data1)
pd1

   B  a  c  d
0  A  b  1  1
1  B  c  2  2

Specify the order of columns

In [5]:
pd2 = pd.DataFrame(data1, columns=[ 'a','B','c','d','e'])
pd2

   a  B  c  d    e
0  b  A  1  1  NaN
1  c  B  2  2  NaN

### Different formats of column data entry

In [7]:
df2 = pd.DataFrame(
              { 'A' : 1., # All one vlaue
                'B' : pd.Timestamp('20130102'),   # date                   
                'C ' :pd.Series(1,index=list(range(4)),dtype='float32'), # series
                'D' : np.array([3] * 4,dtype='int32'), # array
                'E' : pd.Categorical(["test","train","test","train"]),
                'F' : 'foo', 
                'G' : [1,2,3,4]  # list
              })
df2

     A          B   C   D      E    F  G
0  1.0 2013-01-02  1.0  3   test  foo  1
1  1.0 2013-01-02  1.0  3  train  foo  2
2  1.0 2013-01-02  1.0  3   test  foo  3
3  1.0 2013-01-02  1.0  3  train  foo  4

### date range

In [12]:
# eg dates and data
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [60]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.337425  0.419965  0.064828  0.065867
2013-01-02  0.715076  0.896451  0.093573  1.164690
2013-01-03  2.244118  1.075180 -0.458979 -0.642527
2013-01-04  1.139121  0.568490  0.136447  1.537521
2013-01-05  1.549626  0.549848 -0.936035 -0.419732
2013-01-06 -0.099543  0.731738 -0.648349  1.211823

###A dictionary per row (observation)

In [16]:
# row per dict
# list of dicts
data1 = [ { 'a': 1 ,'b':2}, { 'a': 2 ,'b':3}, { 'a': 4 ,'b':5},  ]

pd1 = pd.DataFrame(data1)
pd1

   a  b
0  1  2
1  2  3
2  4  5

### A list of rows (observations, tuples)

In [37]:
# row per tuple
# list of tuples

data1 = [ (1,2,3), (4,5,6), (7,8,9), (10,11,12) ]

pd1 = pd.DataFrame(data1)
pd1

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

### Zipped lists of rows (variables)

In [19]:
# zipped list of tupples
names = ['Bob','Jessica','Mary','John','Mel']
births = [968, 155, 77, 578, 973]
data = list(zip(names,births))
df = pd.DataFrame(data)
df

         0    1
0      Bob  968
1  Jessica  155
2     Mary   77
3     John  578
4      Mel  973

In [47]:
# creation with index
df= pd.DataFrame({"a" : [4 ,5, 6], 
                  "b" : [7, 8, 9], 
                  "c" : [10, 11, 12]}, 
                  index = [1, 2, 3])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

## 3 Add to DataFrame

In [49]:
df = pd.DataFrame({ 'a':[1,2], 'b':[1,2], 'c':[1,2],  })

df['D'] = [10,11]
df

   a  b  c   D
0  1  1  1  10
1  2  2  2  11

Add a whole column

In [39]:
data1 = [ (1,2,3), (4,5,6), (7,8,9), (10,11,12) ]

pd1 = pd.DataFrame(data1)
pd1

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

In [40]:
pd1[3] = pd.Series([ 'a','b'], index=(2,3))
pd1

    0   1   2    3
0   1   2   3  NaN
1   4   5   6  NaN
2   7   8   9    a
3  10  11  12    b

In [34]:
df['E'] = 101
df

                   A         B         C         D    E
2013-01-01  1.163517  0.332166 -0.371921  1.163013  101
2013-01-02 -0.310275  0.566199  0.485881  0.435333  101
2013-01-03 -1.200061  0.996003 -0.696182 -0.662919  101
2013-01-04  1.559395 -1.374973  0.246549 -0.211251  101
2013-01-05  0.319102  1.055651 -0.654020  1.528974  101
2013-01-06 -1.686310 -1.730126 -0.815236  0.523865  101

Add a range

In [36]:
df['F'] = range(1,7)
df

                   A         B         C         D    E  F
2013-01-01  1.163517  0.332166 -0.371921  1.163013  101  1
2013-01-02 -0.310275  0.566199  0.485881  0.435333  101  2
2013-01-03 -1.200061  0.996003 -0.696182 -0.662919  101  3
2013-01-04  1.559395 -1.374973  0.246549 -0.211251  101  4
2013-01-05  0.319102  1.055651 -0.654020  1.528974  101  5
2013-01-06 -1.686310 -1.730126 -0.815236  0.523865  101  6

At specific places

In [38]:
df1

NameError: ignored

In [76]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [77]:
df['F'] = s1
df

                   A         B         C         D    F
2013-01-01 -0.337425  0.419965  0.064828  0.065867  NaN
2013-01-02  0.715076  0.896451  0.093573  1.164690  1.0
2013-01-03  2.244118  1.075180 -0.458979 -0.642527  2.0
2013-01-04  1.139121  0.568490  0.136447  1.537521  3.0
2013-01-05  1.549626  0.549848 -0.936035 -0.419732  4.0
2013-01-06 -0.099543  0.731738 -0.648349  1.211823  5.0

## 4 Update data

In [78]:
# by value
df.at[dates[0],'A'] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.419965  0.064828  0.065867  NaN
2013-01-02  0.715076  0.896451  0.093573  1.164690  1.0
2013-01-03  2.244118  1.075180 -0.458979 -0.642527  2.0
2013-01-04  1.139121  0.568490  0.136447  1.537521  3.0
2013-01-05  1.549626  0.549848 -0.936035 -0.419732  4.0
2013-01-06 -0.099543  0.731738 -0.648349  1.211823  5.0

In [79]:
df.iat[0,1] = 0.1
df

                   A         B         C         D    F
2013-01-01  0.000000  0.100000  0.064828  0.065867  NaN
2013-01-02  0.715076  0.896451  0.093573  1.164690  1.0
2013-01-03  2.244118  1.075180 -0.458979 -0.642527  2.0
2013-01-04  1.139121  0.568490  0.136447  1.537521  3.0
2013-01-05  1.549626  0.549848 -0.936035 -0.419732  4.0
2013-01-06 -0.099543  0.731738 -0.648349  1.211823  5.0

In [81]:
# whole column, update with numpy array
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.100000  0.064828  5  NaN
2013-01-02  0.715076  0.896451  0.093573  5  1.0
2013-01-03  2.244118  1.075180 -0.458979  5  2.0
2013-01-04  1.139121  0.568490  0.136447  5  3.0
2013-01-05  1.549626  0.549848 -0.936035  5  4.0
2013-01-06 -0.099543  0.731738 -0.648349  5  5.0

In [82]:
# where on whole df
df2 = df.copy()
df2[df2 < 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.100000  0.064828  5  NaN
2013-01-02  0.715076  0.896451  0.093573  5  1.0
2013-01-03  2.244118  1.075180  0.458979  5  2.0
2013-01-04  1.139121  0.568490  0.136447  5  3.0
2013-01-05  1.549626  0.549848  0.936035  5  4.0
2013-01-06  0.099543  0.731738  0.648349  5  5.0

## 5 Modify DataFrame

In [28]:
#sort by axis
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -1.125366 -0.250743 -0.727355 -0.614316
2013-01-02  1.273794 -0.449667 -0.488096  0.330320
2013-01-03 -0.144976  0.277706  0.079873 -1.173828
2013-01-04 -1.203602  0.383898  1.510191 -0.220848
2013-01-05 -0.308972 -0.126518 -1.127420  0.657156
2013-01-06  0.104411  1.232420 -0.625490 -1.850150

In [29]:
# sort by data
df.sort_values(by='B')

                   A         B         C         D
2013-01-05  0.657156 -1.127420 -0.126518 -0.308972
2013-01-01 -0.614316 -0.727355 -0.250743 -1.125366
2013-01-06 -1.850150 -0.625490  1.232420  0.104411
2013-01-02  0.330320 -0.488096 -0.449667  1.273794
2013-01-03 -1.173828  0.079873  0.277706 -0.144976
2013-01-04 -0.220848  1.510191  0.383898 -1.203602

## 6 Delete from DataFrame

In [7]:
df = pd.DataFrame( { 'A':(1,2,3), 'B':(22,33,44), 'C':(333,444,555) })
df

   A   B    C
0  1  22  333
1  2  33  444
2  3  44  555

In [8]:
df.drop(['A'], axis=1 )

    B    C
0  22  333
1  33  444
2  44  555

## 7 Reshape DataFrame

## 8 Select from DataFrame

### Column selection

dictionary type select

In [9]:
df['A']

0    1
1    2
2    3
Name: A, dtype: int64

select by attribute

In [10]:
df.A

0    1
1    2
2    3
Name: A, dtype: int64

### Row selection

In [11]:
# by row number
df[0:3]

   A   B    C
0  1  22  333
1  2  33  444
2  3  44  555

select by index

In [19]:
# select by locationn, label (index number)
dates = pd.date_range('20130101', periods=6)
print (dates)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
print (df)

df.loc[dates[0]]

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')
                   A         B         C         D
2013-01-01  1.163517  0.332166 -0.371921  1.163013
2013-01-02 -0.310275  0.566199  0.485881  0.435333
2013-01-03 -1.200061  0.996003 -0.696182 -0.662919
2013-01-04  1.559395 -1.374973  0.246549 -0.211251
2013-01-05  0.319102  1.055651 -0.654020  1.528974
2013-01-06 -1.686310 -1.730126 -0.815236  0.523865

A    1.163517
B    0.332166
C   -0.371921
D    1.163013
Name: 2013-01-01 00:00:00, dtype: float64

In [29]:

df2 = pd.DataFrame(data1, index=['y','z'])
df2

   B  a  c  d
y  A  b  1  1
z  B  c  2  2

In [31]:
df2.loc['z']

B    B
a    c
c    2
d    2
Name: z, dtype: object

In [36]:
# select by location, index and columns
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.330320 -0.488096
2013-01-03 -1.173828  0.079873
2013-01-04 -0.220848  1.510191

In [37]:
# select by location number ( index, columns)
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.220848  1.510191
2013-01-05  0.657156 -1.127420

In [38]:
# select specific location by number
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.330320 -0.449667
2013-01-03 -1.173828  0.277706
2013-01-05  0.657156 -0.126518

In [39]:
# select a whole row 
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.330320 -0.488096 -0.449667  1.273794
2013-01-03 -1.173828  0.079873  0.277706 -0.144976

In [41]:
# select a whole column
df.iloc[:,:2:3]

                   A
2013-01-01 -0.614316
2013-01-02  0.330320
2013-01-03 -1.173828
2013-01-04 -0.220848
2013-01-05  0.657156
2013-01-06 -1.850150

In [42]:
# single value
 df.iloc[1,1]  # or faster df.iat[1,1]

-0.48809592032947724

In [43]:
# select where (select row where value ..)
df[df.A > 0]

                   A         B         C         D
2013-01-02  0.330320 -0.488096 -0.449667  1.273794
2013-01-05  0.657156 -1.127420 -0.126518 -0.308972

In [45]:
# select value where value ...
df[df>0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02  0.330320       NaN       NaN  1.273794
2013-01-03       NaN  0.079873  0.277706       NaN
2013-01-04       NaN  1.510191  0.383898       NaN
2013-01-05  0.657156       NaN       NaN       NaN
2013-01-06       NaN       NaN  1.232420  0.104411

In [70]:
# select where row where value is in ...

df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']

df2[ df2['E'].isin(['one','four',]) ]

                   A         B         C         D     E
2013-01-01 -0.337425  0.419965  0.064828  0.065867   one
2013-01-02  0.715076  0.896451  0.093573  1.164690   one
2013-01-05  1.549626  0.549848 -0.936035 -0.419732  four

## 9 Group by ...

## 10 Missing data ...

In [84]:
np.NaN

nan

In [0]:
# dropna (how='any')
# fillna(value = 5)

## 11 Merging DataFrames

In [23]:
eg1 = pd.DataFrame( { 'A':[1] , 'B':[2], 'C':[3] }, [0] )
eg2 = pd.DataFrame( { 'A':[1] , 'B':['b'], 'D':['d'] }, [0] )
print (eg1)
print ()
print (eg2)
print ()
print (pd.merge(eg1, eg2,how='left') )  # on='x1'
print ()
print (pd.merge(eg1, eg2,how='right'))
print ()
print (pd.merge(eg1, eg2,how='inner') )
print ()
print (pd.merge(eg1, eg2,how='outer'))

   A  B  C
0  1  2  3

   A  B  D
0  1  b  d

   A  B  C    D
0  1  2  3  NaN

   A  B   C  D
0  1  b NaN  d

Empty DataFrame
Columns: [A, B, C, D]
Index: []

   A  B    C    D
0  1  2  3.0  NaN
1  1  b  NaN    d

In [24]:
eg1 = pd.DataFrame( { 'A':1 , 'B':2, 'C':3 }, [0] )
eg2 = pd.DataFrame( { 'A':[10] , 'B':[20], 'C':[30] }, [0] )
print (eg1)
print ()
print (eg2)
print ()
print (pd.merge(eg1, eg2,how='left') )  # on='x1'
print ()
print (pd.merge(eg1, eg2,how='right'))
print ()
print (pd.merge(eg1, eg2,how='inner') )
print ()
print (pd.merge(eg1, eg2,how='outer'))

   A  B  C
0  1  2  3

    A   B   C
0  10  20  30

   A  B  C
0  1  2  3

    A   B   C
0  10  20  30

Empty DataFrame
Columns: [A, B, C]
Index: []

    A   B   C
0   1   2   3
1  10  20  30

## Unclassified

apply -- > modify data

melt